<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>About</title>
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/modern-normalize/1.1.0/modern-normalize.min.css" />
    <link rel="stylesheet" href="./css/style.css" />
</head>
<body>
    <nav id="main_navigation" role="main">
        <a href="./home.html">Home</a>
        <a href="./about.html">About</a>
        <a href="./events.html">Events</a>
    </nav>
    <main>
        <section id="main_content">
            <h1 id="page_title">O Wikipediji</h1>
            
            <p>Wikipedia, internetska enciklopedija sa slobodnim sadr&#382;ajem i slobodnim pristupom koju podr&#382;ava i hosta neprofitni Wikimedia Foundation. Oni koji mogu pristupiti siteu, mogu urediti ve&#263;inu njezinih &#269;lanaka.</p>

            <p>Wikipedia je rangirana me&#273;u deset najpopularnijih websiteova (13. 'top site' prema rangiranju na 'alexa.com') i najve&#263;e je i najpopularnije op&#263;e referentno djelo na internetu.</p>

            <p>Jimmy Wales i Larry Sanger pokrenuli su Wikipediju 15. januara 2001. Njezino ime, portmanteau od engl. wiki, skovao je Sanger. Inicijalno samo na engleskom, Wikipedia je brzo postala vi&#353;ejezi&#269;na po&#353;to je na drugim jezicima razvila sli&#269;ne verzije, koje se razlikuju u sadr&#382;aju i praksama ure&#273;enja.</p>

            <p>Srpskohrvatska Wikipedia sada je jedno od 306 jezi&#269;kih izdanja Wikipedije i sa 456.498 &#269;lanaka spada u njezinih 30 najve&#263;ih izdanja, dok po broju &#269;lanaka prvo mjesto zauzima engleska Wikipedia (u novembru 2015. dosegla 5 000 000 &#269;lanaka). Uzev&#353;i u obzir sva izdanja, Wikipedia sadr&#382;i vi&#353;e od 50 mil. &#269;lanaka. Prema stanju iz februara 2014. imala je 18 milijardi pregleda i gotovo 500 mil. jedinstvenih posjetitelja svaki mjesec.</p>

            <p>Podupiratelji Wikipedije citiraju istra&#382;ivanje objavljeno 2005. u Natureu, gdje su na osnovi 42 znanstvena &#269;lanka komparirane Wikipedia i Encyclop&aelig;dia Britannica, pri &#269;emu je utvr&#273;eno da se nivo to&#269;nosti Wikipedije pribli&#382;io onom koji ima Encyclop&aelig;dia Britannica. Kritika Wikipedije obuhva&#263;a tvrdnje o tome da ona pokazuje sistemsku pristranost, predstavlja mje&#353;avinu &raquo;istina, poluistina i ne&#353;to neistina&laquo; i predmet je manipulacije i spinanja.</p>
        </section>
    </main>
</body>
</html>