<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Home</title>
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/modern-normalize/1.1.0/modern-normalize.min.css" />
    <link rel="stylesheet" href="./css/style.css" />
</head>
<body>
    <nav id="main_navigation" role="main">
        <a href="./home.html">Home</a>
        <a href="./about.html">About</a>
        <a href="./events.html">Events</a>
    </nav>
    <div>
        <h1>
            <span>Programiranje</span>
        </h1>
        <h2>Iz Wikipedije, slobodne enciklopedije</h2>
    </div>
    <main>
        <section id="main_content">
            <article>
                <h1>Programer na poslu</h1>
                <div>
                    <img src="./images/programer.jpg" />
                </div>
                <p>Programiranje ili ra&#269;unarsko programiranje (engl. programming) jeste vje&#353;tina pomo&#263;u koje korisnik stvara i izvr&#353;ava algoritme koriste&#263;i odre&#273;ene programske jezike da bi napravio ra&#269;unarski program. Programiranje sadr&#382;i elemente umjetnosti, nauke, matematike i inzinjerstva.</p>
            </article>
            <article>
                <h1>Programski jezici</h1>
                <p>Svaki programer pi&#353;e programski kod u nekom programskom jeziku. Razli&#269;iti programski jezici podr&#382;avaju razli&#269;ite stilove programiranja (programska paradigma). Razli&#269;iti programski jezici zahtjevaju razli&#269;ite nivoe znanja, umije&#263;a i detalja koje programer treba posjedovati.</p>
                <p>Jedini programski jezik koji ra&#269;unar mo&#382;e direktno izvr&#353;avati je ma&#353;inski jezik (ma&#353;inski kod ili binarni kod). U po&#269;ecima ra&#269;unarstva programeri su pisali u ma&#353;inskom kodu, &#353;to je bilo vrlo komplikovano i zamorno. Sljede&#263;i korak u razvoju ra&#269;unarskog programiranja ogleda se u upotrebi simboli&#269;kih jezika, poznatih pod zajedni&#269;kim nazivom asembler. Asemblerski jezici sastoje se od jednostavnih instrukcija koje se direktno i jednozna&#269;no mogu prevesti u ma&#353;inski kod koji se direktno izvr&#353;ava. Iako mnogo pogodnije i od ma&#353;inskog programiranja, asemblersko programiranje karakteri&#353;e velika koli&#269;ina posla koju programer mora obaviti, zbog &#269;injenice da su operacije i dalje elementarne. Zbog toga su stru&#269;njaci stvorili programske jezike vi&#353;eg nivoa pomo&#263;u kojih se pi&#353;e izvorni kod koji se u ma&#353;inski kod prevodi posredstvom specijalnih programa - prevodilaca &#269;iji je zadatak da prevede kod vi&#353;eg programskog jezika,u kod nizeg jezika, kao asembler, tj u ma&#353;inski kod tzv. interpreter i kompajler.</p>
            </article>
        </section>
    </main>
    <footer>
        <p>&copy; ITAkademija 2022</p>
    </footer>
</body>
</html>